project2/executive_summary.org
#+Title: Analysis Report
#+Author: Edgar Huamantla
#+Date: <2026-04-18 Sat>

* Beta and Risk Measure Recommendations

** Historical Beta vs Beta
Historical Beta (HBETA) is a measure of the a company's return relative to the market using 60 months of prior data.
Beta would measure a security's sensitivity to the market conditions.

We looked to compare HBETA or BETA predictive abilities by sector.

*** Historical Beta Prediction Ability by Sector
We did this by plotting stock returns (2008 price less 2007 price over 2007 Price) by sectors to determine if there was
a relationship.
For the Technology and Communication sector, historical beta was able to capture the direction but the dispersion of the points
suggests it wasn't able to capture precisely the return. The companies with higher historical beta than the average did experience
negative stock return in general. 
For the financial sector, historical beta had even more dispersion. Stocks with a higher beta generally did have negative return but
those with lower historical beta closer to the market (~.6) was a coin flip.
Energy stocks with a HBETA .8 std deviation units above the market, had a higher return.
The transport industry had 1 std deviation unit of beta above the market as a whole and had a -22% return.
Basic Materials, historical beta captured the direction and was able to explain the stock return. The points were on the line.
Healthcare, historical beta was able to capture the general direction with stocks that had .5 std deviations unit higher than the market
but also had more dispersion.
For industrials, historical beta was able to capture the direction and the points were closer to the line for stocks with a historical beta
one unit higher than the market.
Consumer staples, historical beta was able to predict the negative relationship between .4 units and .9. Stocks with a .94 historical beta
could not be used as a good estimate of how much the underperformance would be.
Consumer discretionary stocks with a hbeta between .4 and 1.3 units captured the negative relationshp. Stocks outside those bounds outperformed
the market.
Real esate and utilities was similar to the transportation sector, clustering around .5 hbeta. The sector had -31% stock return.

This suggests that the real estate and transport sectors could be used as reference points to other indusry performance.
Together they both sit on opposite ends of historical beta, real estate having a .457 units compared to the market and transport having near 1
unit above the market (.991). As reference points they can be used to determine how other stocks with similar historical beta performed.
When looking at financial sectors we see stocks with a lower historical beta, .53 performed like the real estate sector but then it wasn't
able to predict whether a stock's performance after that.

*** Beta prediction ability by sector
Tech communication industry Beta was able to better explain a stocks performance with the data points closer to the regression line, with the exception
of those companies that had 1 beta unit, there were vertical points where it could have gone either way.
FInancial sector performance was better explained with beta less than .75 and greater than 1.7. In between those, stocks could have gone in either direction
with returns between 0% and -65%.
The energy sector, beta was .88 could be used to explain a positive performance.
The Basics Materials sectors behaved the same with historical and beta. Its performance could be explained by both.
The healthcare sector beta better explained the stock's return and captured the direction between .6 and .9. Outside of that range, stocks could go either way.
Industrial sector was well explained by the beta measure, having captured the relationship and having less dispersion.
For consumer staples, beta didn't do anything to predict the direction or performance of a stocks return.
For consumer discre, stocks with a beta higher than .8 it had predictive power. at .8 a stock could have gone either way.

What we see is stocks with 1 beta unit, it could have gone either way for all sectors as they are clustering vertically.
However its important to note that basic material sectors behaved in line with both historical beta and beta. There wasn't much dispersion as compared to
other sectors.

** Metric Performance

*** BETA
_main__ - 2026-04-18 11:11:04,894 - INFO - Skipping BASIC_MAT: cannot compute beta model (only 2 rows, need >= 5).
__main__ - 2026-04-18 11:11:04,903 - INFO - Skipping REALESTATE_UTIL: cannot compute beta model (only 1 rows, need >= 5).
__main__ - 2026-04-18 11:11:04,905 - INFO - Skipping TRANSPORT: cannot compute beta model (only 1 rows, need >= 5).

|--------------+-----------+--------+---------+----|
| Sector       | R-Squared |   RMSE | P-Value |  N |
|--------------+-----------+--------+---------+----|
| FINANCIAL    |    0.3546 | 0.2019 |  0.0693 | 10 |
| HEALTHCARE   |    0.1575 | 0.2312 |  0.1600 | 14 |
| TECH_COMM    |    0.1463 | 0.1480 |  0.1771 | 14 |
| CONS_DISCR   |    0.2173 | 0.2134 |  0.3514 |  6 |
| ENERGY       |    0.1140 | 0.1488 |  0.4590 |  7 |
| INDUSTRIAL   |    0.0829 | 0.1323 |  0.5311 |  7 |
| CONS_STAPLES |    0.0011 | 0.2827 |  0.9509 |  6 |


*** HBETA
__main__ - 2026-04-18 11:10:45,634 - INFO - Skipping BASIC_MAT: cannot compute historical_beta model (only 2 rows, need >= 5).
__main__ - 2026-04-18 11:10:45,644 - INFO - Skipping REALESTATE_UTIL: cannot compute historical_beta model (only 1 rows, need >= 5).
__main__ - 2026-04-18 11:10:45,646 - INFO - Skipping TRANSPORT: cannot compute historical_beta model (only 1 rows, need >= 5).


|--------------+-----------+--------+---------+----|
| Sector       | R-Squared |   RMSE | P-Value |  N |
|--------------+-----------+--------+---------+----|
| HEALTHCARE   |    0.2630 | 0.2162 |  0.0608 | 14 |
| TECH_COMM    |    0.2137 | 0.1421 |  0.0961 | 14 |
| CONS_STAPLES |    0.3135 | 0.2343 |  0.2479 |  6 |
| INDUSTRIAL   |    0.1902 | 0.1244 |  0.3280 |  7 |
| FINANCIAL    |    0.0859 | 0.2402 |  0.4111 | 10 |
| ENERGY       |    0.0700 | 0.1525 |  0.5664 |  7 |
| CONS_DISCR   |    0.0132 | 0.2397 |  0.8283 |  6 |

