project2/executive_summary.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-04-18 Sat 14:49 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Analysis Report</title>
<meta name="author" content="Edgar Huamantla" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Analysis Report</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org1a8e356">1. Beta and Risk Measure Recommendations</a>
<ul>
<li><a href="#org6a0bbdd">1.1. Historical Beta vs Beta</a>
<ul>
<li><a href="#org2e0192b">1.1.1. Historical Beta Prediction Ability by Sector</a></li>
<li><a href="#orgae1d56e">1.1.2. Beta prediction ability by sector</a></li>
</ul>
</li>
<li><a href="#org0656c03">1.2. Metric Performance</a>
<ul>
<li><a href="#orgabd8e00">1.2.1. BETA</a></li>
<li><a href="#org430687f">1.2.2. HBETA</a></li>
</ul>
</li>
<li><a href="#org376db88">1.3. HBETA VS BETA</a></li>
</ul>
</li>
<li><a href="#org1ed3aea">2. Systematic Risk vs Total Risk</a>
<ul>
<li><a href="#org5f50575">2.1. Recommendation to Risk Team: Systematic Risk vs Total Risk</a></li>
</ul>
</li>
<li><a href="#org21a15a9">3. Which Factors best predict percent change between 2007-2008</a></li>
<li><a href="#org41e52e3">4. Which is faster? CTE VS SUBQUERY VS VIEW</a></li>
</ul>
</div>
</div>
<div id="outline-container-org1a8e356" class="outline-2">
<h2 id="org1a8e356"><span class="section-number-2">1.</span> Beta and Risk Measure Recommendations</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org6a0bbdd" class="outline-3">
<h3 id="org6a0bbdd"><span class="section-number-3">1.1.</span> Historical Beta vs Beta</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Historical Beta (HBETA) is a measure of the a company's return relative to the market using 60 months of prior data.
Beta would measure a security's sensitivity to the market conditions.
</p>

<p>
We looked to compare HBETA or BETA predictive abilities by sector.
</p>
</div>
<div id="outline-container-org2e0192b" class="outline-4">
<h4 id="org2e0192b"><span class="section-number-4">1.1.1.</span> Historical Beta Prediction Ability by Sector</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
We did this by plotting stock returns (2008 price less 2007 price over 2007 Price) by sectors to determine if there was
a relationship.
For the Technology and Communication sector, historical beta was able to capture the direction but the dispersion of the points
suggests it wasn't able to capture precisely the return. The companies with higher historical beta than the average did experience
negative stock return in general. 
For the financial sector, historical beta had even more dispersion. Stocks with a higher beta generally did have negative return but
those with lower historical beta closer to the market (~.6) was a coin flip.
Energy stocks with a HBETA .8 std deviation units above the market, had a higher return.
The transport industry had 1 std deviation unit of beta above the market as a whole and had a -22% return.
Basic Materials, historical beta captured the direction and was able to explain the stock return. The points were on the line.
Healthcare, historical beta was able to capture the general direction with stocks that had .5 std deviations unit higher than the market
but also had more dispersion.
For industrials, historical beta was able to capture the direction and the points were closer to the line for stocks with a historical beta
one unit higher than the market.
Consumer staples, historical beta was able to predict the negative relationship between .4 units and .9. Stocks with a .94 historical beta
could not be used as a good estimate of how much the underperformance would be.
Consumer discretionary stocks with a hbeta between .4 and 1.3 units captured the negative relationshp. Stocks outside those bounds outperformed
the market.
Real esate and utilities was similar to the transportation sector, clustering around .5 hbeta. The sector had -31% stock return.
</p>

<p>
This suggests that the real estate and transport sectors could be used as reference points to other indusry performance.
Together they both sit on opposite ends of historical beta, real estate having a .457 units compared to the market and transport having near 1
unit above the market (.991). As reference points they can be used to determine how other stocks with similar historical beta performed.
When looking at financial sectors we see stocks with a lower historical beta, .53 performed like the real estate sector but then it wasn't
able to predict whether a stock's performance after that.
</p>
</div>
</div>
<div id="outline-container-orgae1d56e" class="outline-4">
<h4 id="orgae1d56e"><span class="section-number-4">1.1.2.</span> Beta prediction ability by sector</h4>
<div class="outline-text-4" id="text-1-1-2">
<p>
Tech communication industry Beta was able to better explain a stocks performance with the data points closer to the regression line, with the exception
of those companies that had 1 beta unit, there were vertical points where it could have gone either way.
FInancial sector performance was better explained with beta less than .75 and greater than 1.7. In between those, stocks could have gone in either direction
with returns between 0% and -65%.
The energy sector, beta was .88 could be used to explain a positive performance.
The Basics Materials sectors behaved the same with historical and beta. Its performance could be explained by both.
The healthcare sector beta better explained the stock's return and captured the direction between .6 and .9. Outside of that range, stocks could go either way.
Industrial sector was well explained by the beta measure, having captured the relationship and having less dispersion.
For consumer staples, beta didn't do anything to predict the direction or performance of a stocks return.
For consumer discre, stocks with a beta higher than .8 it had predictive power. at .8 a stock could have gone either way.
</p>

<p>
What we see is stocks with 1 beta unit, it could have gone either way for all sectors as they are clustering vertically.
However its important to note that basic material sectors behaved in line with both historical beta and beta. There wasn't much dispersion as compared to
other sectors.
</p>
</div>
</div>
</div>
