project2/executive_summary.org
** Recommendation to Risk Team: Systematic Risk vs Total Risk
As a whole, neither Systematic Risk and Total Risk had statistically significant predictive power.

Risk Metric Performance vs Realized Return:

|------------+-----------+--------+---------+--------|
|            | R-Squared |   RMSE | P-Value |        |
|------------+-----------+--------+---------+--------|
| Total      | Risk      | 0.0247 |  0.2088 | 0.2009 |
| Systematic | Risk      | 0.0000 |  0.2114 |   0.99 |
|------------+-----------+--------+---------+--------|


Per sector, Total risk was able to explain the variations of stock returns for Consumer Staples and the Financial sector,
71% R^2 and 42% R^2.

|--------------+-----------+--------+---------+----|
| Sector       | R-Squared |   RMSE | P-Value |  N |
|--------------+-----------+--------+---------+----|
| CONS_STAPLES |    0.7159 | 0.1508 |  0.0337 |  6 |
| FINANCIAL    |    0.4204 | 0.1913 |  0.0426 | 10 |
| TECH_COMM    |    0.2176 | 0.1417 |  0.0927 | 14 |
| CONS_DISCR   |    0.4399 | 0.1806 |  0.1510 |  6 |
| HEALTHCARE   |    0.1582 | 0.2311 |  0.1591 | 14 |
| ENERGY       |    0.3239 | 0.1300 |  0.1823 |  7 |
| INDUSTRIAL   |    0.0002 | 0.1382 |  0.9756 |  7 |
|--------------+-----------+--------+---------+----|

Systematic Risk was able to explain 72% of the variations of stocks returns for Consumer Discretionary sector but had little
predictive value for the other sectors.

|--------------+-----------+--------+---------+----|
| Sector       | R-Squared |   RMSE | P-Value |  N |
|--------------+-----------+--------+---------+----|
| CONS_DISCR   |    0.7245 | 0.1266 |  0.0316 |  6 |
| FINANCIAL    |    0.3982 | 0.1949 |  0.0504 | 10 |
| TECH_COMM    |    0.1675 | 0.1462 |  0.1462 | 14 |
| HEALTHCARE   |    0.1113 | 0.2374 |  0.2437 | 14 |
| CONS_STAPLES |    0.0380 | 0.2774 |  0.7114 |  6 |
| INDUSTRIAL   |    0.0284 | 0.1362 |  0.7177 |  7 |
| ENERGY       |    0.0056 | 0.1577 |  0.8730 |  7 |
|--------------+-----------+--------+---------+----|

Based on our results, we would suggest the risk management use total risk only for the consumer staple and financial sectors.
While using the systematic risk measure for Consumer Discretionary stocks only.

* Which Factors best predict percent change between 2007-2008
What we sought to do at first was to review our given values. We knew that they were normalized but Barra traditionally normalized
based on S&P500 membership. So we sought to test this out.  Our results showed that the factor values were instead normalized by
the Barra estimation universe, having a Standard Deviation of 1, with their relative influence determined by their capitalization.

What we sought to do was to replicate Rosenberg and Marath's claim that our regression lines would be improved with the addition
of technical and fundamental factors over using strictly historical performance -- the Bayesian baseline. What the results would tell
us is if these claims held during the financial crisis. Rosengberg and Marath found that using factors that came from market
observations (technical factors) they would get a 57% improvement in predictive power. Using only information from a company's
financial statements, they would see a 45% improvement. However, they saw that a combination of both helped explain variance by 85%
over just using historical price movement.

The stocks we reviewed were those in the Barra Estimation universe and with a size factor greater than 0. This left us with 97 stocks.
We wanted to do an analysis by sectors but because of small membership we had to group them into 'super-sectors'. The super-sector we
left out was "Healthcare and Staples" purely because of economic intuition. We felt this was a defensive sector and could be used
as a reference point.

Of the factors, trading activity was the best predictor of future pricing. The other factors did not show statistical significance.
The factors were distinct enough from each other given by our condition number of being under 30 -- we had a value of 9 indicating
there wasn't a strong multi-collinearity effect between the factors.

What our results showed that the Rossenberg and Mareth's claim did not during the financial crisis. Fundamentals and Technicals
performed slightly worse than using market information alone.

|---+----------------------------------------+-----------+----------------+----------+--------------------+-------------------|
|   | Model Name                             | R-Squared | Adj. R-Squared |      AIC | Prob (F-statistic) | % Imp vs Baseline |
|---+----------------------------------------+-----------+----------------+----------+--------------------+-------------------|
| 0 | Baseline                               |    0.2980 |         0.2594 |  -5.1265 |         4.3100e-06 |            0.0000 |
| 1 | Approach A - Technicals                |    0.4334 |         0.3819 | -19.9228 |         2.0056e-08 |           47.2443 |
| 2 | Approach B - Fundamentals              |    0.3716 |         0.3144 |  -9.8709 |         1.2395e-06 |           21.2257 |
| 3 | Approach C - FUNDAMENTALS + TECHNICALS |    0.4485 |         0.3771 | -16.5342 |         1.7259e-07 |           45.3870 |
|---+----------------------------------------+-----------+----------------+----------+--------------------+-------------------|

