project2/executive_summary.html
<div id="outline-container-org5f50575" class="outline-3">
<h3 id="org5f50575"><span class="section-number-3">2.1.</span> Recommendation to Risk Team: Systematic Risk vs Total Risk</h3>
<div class="outline-text-3" id="text-2-1">
<p>
As a whole, neither Systematic Risk and Total Risk had statistically significant predictive power.
</p>

<p>
Risk Metric Performance vs Realized Return:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&nbsp;</th>
<th scope="col" class="org-left">R-Squared</th>
<th scope="col" class="org-right">RMSE</th>
<th scope="col" class="org-right">P-Value</th>
<th scope="col" class="org-right">&nbsp;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Total</td>
<td class="org-left">Risk</td>
<td class="org-right">0.0247</td>
<td class="org-right">0.2088</td>
<td class="org-right">0.2009</td>
</tr>

<tr>
<td class="org-left">Systematic</td>
<td class="org-left">Risk</td>
<td class="org-right">0.0000</td>
<td class="org-right">0.2114</td>
<td class="org-right">0.99</td>
</tr>
</tbody>
</table>


<p>
Per sector, Total risk was able to explain the variations of stock returns for Consumer Staples and the Financial sector,
71% R<sup>2</sup> and 42% R<sup>2</sup>.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Sector</th>
<th scope="col" class="org-right">R-Squared</th>
<th scope="col" class="org-right">RMSE</th>
<th scope="col" class="org-right">P-Value</th>
<th scope="col" class="org-right">N</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">CONS<sub>STAPLES</sub></td>
<td class="org-right">0.7159</td>
<td class="org-right">0.1508</td>
<td class="org-right">0.0337</td>
<td class="org-right">6</td>
</tr>

<tr>
<td class="org-left">FINANCIAL</td>
<td class="org-right">0.4204</td>
<td class="org-right">0.1913</td>
<td class="org-right">0.0426</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-left">TECH<sub>COMM</sub></td>
<td class="org-right">0.2176</td>
<td class="org-right">0.1417</td>
<td class="org-right">0.0927</td>
<td class="org-right">14</td>
</tr>

<tr>
<td class="org-left">CONS<sub>DISCR</sub></td>
<td class="org-right">0.4399</td>
<td class="org-right">0.1806</td>
<td class="org-right">0.1510</td>
<td class="org-right">6</td>
</tr>

<tr>
<td class="org-left">HEALTHCARE</td>
<td class="org-right">0.1582</td>
<td class="org-right">0.2311</td>
<td class="org-right">0.1591</td>
<td class="org-right">14</td>
</tr>

<tr>
<td class="org-left">ENERGY</td>
<td class="org-right">0.3239</td>
<td class="org-right">0.1300</td>
<td class="org-right">0.1823</td>
<td class="org-right">7</td>
</tr>

<tr>
<td class="org-left">INDUSTRIAL</td>
<td class="org-right">0.0002</td>
<td class="org-right">0.1382</td>
<td class="org-right">0.9756</td>
<td class="org-right">7</td>
</tr>
</tbody>
</table>

<p>
Systematic Risk was able to explain 72% of the variations of stocks returns for Consumer Discretionary sector but had little
predictive value for the other sectors.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Sector</th>
<th scope="col" class="org-right">R-Squared</th>
<th scope="col" class="org-right">RMSE</th>
<th scope="col" class="org-right">P-Value</th>
<th scope="col" class="org-right">N</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">CONS<sub>DISCR</sub></td>
<td class="org-right">0.7245</td>
<td class="org-right">0.1266</td>
<td class="org-right">0.0316</td>
<td class="org-right">6</td>
</tr>

<tr>
<td class="org-left">FINANCIAL</td>
<td class="org-right">0.3982</td>
<td class="org-right">0.1949</td>
<td class="org-right">0.0504</td>
<td class="org-right">10</td>
</tr>

<tr>
<td class="org-left">TECH<sub>COMM</sub></td>
<td class="org-right">0.1675</td>
<td class="org-right">0.1462</td>
<td class="org-right">0.1462</td>
<td class="org-right">14</td>
</tr>

<tr>
<td class="org-left">HEALTHCARE</td>
<td class="org-right">0.1113</td>
<td class="org-right">0.2374</td>
<td class="org-right">0.2437</td>
<td class="org-right">14</td>
</tr>

<tr>
<td class="org-left">CONS<sub>STAPLES</sub></td>
<td class="org-right">0.0380</td>
<td class="org-right">0.2774</td>
<td class="org-right">0.7114</td>
<td class="org-right">6</td>
</tr>

<tr>
<td class="org-left">INDUSTRIAL</td>
<td class="org-right">0.0284</td>
<td class="org-right">0.1362</td>
<td class="org-right">0.7177</td>
<td class="org-right">7</td>
</tr>

<tr>
<td class="org-left">ENERGY</td>
<td class="org-right">0.0056</td>
<td class="org-right">0.1577</td>
<td class="org-right">0.8730</td>
<td class="org-right">7</td>
</tr>
</tbody>
</table>

<p>
Based on our results, we would suggest the risk management use total risk only for the consumer staple and financial sectors.
While using the systematic risk measure for Consumer Discretionary stocks only.
</p>
</div>
</div>
</div>
<div id="outline-container-org21a15a9" class="outline-2">
<h2 id="org21a15a9"><span class="section-number-2">3.</span> Which Factors best predict percent change between 2007-2008</h2>
<div class="outline-text-2" id="text-3">
<p>
What we sought to do at first was to review our given values. We knew that they were normalized but Barra traditionally normalized
based on S&amp;P500 membership. So we sought to test this out.  Our results showed that the factor values were instead normalized by
the Barra estimation universe, having a Standard Deviation of 1, with their relative influence determined by their capitalization.
</p>

<p>
What we sought to do was to replicate Rosenberg and Marath's claim that our regression lines would be improved with the addition
of technical and fundamental factors over using strictly historical performance &ndash; the Bayesian baseline. What the results would tell
us is if these claims held during the financial crisis. Rosengberg and Marath found that using factors that came from market
observations (technical factors) they would get a 57% improvement in predictive power. Using only information from a company's
financial statements, they would see a 45% improvement. However, they saw that a combination of both helped explain variance by 85%
over just using historical price movement.
</p>

<p>
The stocks we reviewed were those in the Barra Estimation universe and with a size factor greater than 0. This left us with 97 stocks.
We wanted to do an analysis by sectors but because of small membership we had to group them into 'super-sectors'. The super-sector we
left out was "Healthcare and Staples" purely because of economic intuition. We felt this was a defensive sector and could be used
as a reference point.
</p>

<p>
Of the factors, trading activity was the best predictor of future pricing. The other factors did not show statistical significance.
The factors were distinct enough from each other given by our condition number of being under 30 &ndash; we had a value of 9 indicating
there wasn't a strong multi-collinearity effect between the factors.
</p>

<p>
What our results showed that the Rossenberg and Mareth's claim did not during the financial crisis. Fundamentals and Technicals
performed slightly worse than using market information alone.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&nbsp;</th>
<th scope="col" class="org-left">Model Name</th>
<th scope="col" class="org-right">R-Squared</th>
<th scope="col" class="org-right">Adj. R-Squared</th>
<th scope="col" class="org-right">AIC</th>
<th scope="col" class="org-right">Prob (F-statistic)</th>
<th scope="col" class="org-right">% Imp vs Baseline</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">Baseline</td>
<td class="org-right">0.2980</td>
<td class="org-right">0.2594</td>
<td class="org-right">-5.1265</td>
<td class="org-right">4.3100e-06</td>
<td class="org-right">0.0000</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">Approach A - Technicals</td>
<td class="org-right">0.4334</td>
<td class="org-right">0.3819</td>
<td class="org-right">-19.9228</td>
<td class="org-right">2.0056e-08</td>
<td class="org-right">47.2443</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">Approach B - Fundamentals</td>
<td class="org-right">0.3716</td>
<td class="org-right">0.3144</td>
<td class="org-right">-9.8709</td>
<td class="org-right">1.2395e-06</td>
<td class="org-right">21.2257</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Approach C - FUNDAMENTALS + TECHNICALS</td>
<td class="org-right">0.4485</td>
<td class="org-right">0.3771</td>
<td class="org-right">-16.5342</td>
<td class="org-right">1.7259e-07</td>
<td class="org-right">45.3870</td>
</tr>
</tbody>
</table>
</div>
</div>
