project2/executive_summary.org
* Which is faster? CTE VS SUBQUERY VS VIEW

Our results showed that on average, they all performed the same. Which was more an indication of the SQL optimizing engine's
performance. We ran a sql statement fetching this data using the three methods 50 times and on average they were about the same.
The View was the 'winner' but it offered the least flexibility to a user.
