project2/executive_summary.html
<div id="outline-container-org41e52e3" class="outline-2">
<h2 id="org41e52e3"><span class="section-number-2">4.</span> Which is faster? CTE VS SUBQUERY VS VIEW</h2>
<div class="outline-text-2" id="text-4">
<p>
Our results showed that on average, they all performed the same. Which was more an indication of the SQL optimizing engine's
performance. We ran a sql statement fetching this data using the three methods 50 times and on average they were about the same.
The View was the 'winner' but it offered the least flexibility to a user.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2026-04-18 Sat 00:00</p>
<p class="author">Author: Edgar Huamantla</p>
<p class="date">Created: 2026-04-18 Sat 14:49</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
